tutorials/premixedFlame/CH4air.phi1.0/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;  //mm

vertices
(
  (0   0  0)     //0
  (100 0  0)     //1
  (100 10 0)     //2

  (0   10 0)     //3
  (0   0  10)    //4
  (100 0  10)    //5

  (100 10 10)    //6
  (0   10 10)    //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7)     (10000 1 1)  simpleGrading (1 1 1) //block1
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (4 5 6 7)
            (7 6 2 3)
            (3 2 1 0)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
